# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
# -- coding: utf-8--
one = int(input('введите первое число '))
two = int(input('введите второе число '))
three = int(input('введите третье число '))
summa = one + two +three
print('сумма введенных чисел: ', summa)